#+TITLE: Python Org Babel Example
#+PROPERTY: header-args:python :session py :results output :exports both

* Setup

#+BEGIN_SRC python
  import sys
  print(f"Python executable: {sys.executable}")
#+END_SRC

#+RESULTS:
: Python executable: /home/nehal/.emacs.d/Projects/Software/pykal/.venv/bin/python

* Define a function

#+BEGIN_SRC python
def square(x):
    return x * x
#+END_SRC

* Use the function

#+BEGIN_SRC python
print(square(5))
#+END_SRC

* LSP Test

Type `C-c '` on this block and try autocompletion, type hints, or jump to definition (e.g., `M-.`):

#+BEGIN_SRC python
square
#+END_SRC

#+begin_src python
  
#+end_src
